uat_chat/Catalogs/ItobМестоположенияПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ItobМестоположенияПоУмолчанию</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/ItobМестоположенияПоУмолчанию/Forms/ФормаОпределенияПоложения/Ext/Form/Module.bsl
&НаКлиенте
Перем мСчетчикДокументСформирован;

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мСчетчикДокументСформирован = 0;
	
	АтрибутыКарты = "";
	Если Широта <> 0 И Долгота <> 0 И Масштаб <> 0 Тогда
		
		АтрибутыКарты = 
			"firstZoom = "+Формат(Масштаб,"ЧГ=0")+";
			|firstLat = "+ItobОбщегоНазначенияКлиентСервер.ФорматироватьКоординаты(Широта)+";
			|firstLon = "+ItobОбщегоНазначенияКлиентСервер.ФорматироватьКоординаты(Долгота)+";";		
		
	КонецЕсли;
	
	ПолеHTML = ItobОперативныйМониторинг.ПолучитьАдресКарты(АтрибутыКарты);
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ДокументСформирован" поля HTML "ПолеHTML".
//
&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если мСчетчикДокументСформирован = 0
		И Найти(СисИнфо.ИнформацияПрограммыПросмотра, "Firefox") <> 0 
		Тогда
		
		ПодключитьОбработчикОжидания("ОбновитьПолеHTML", 0.1, Истина);
		
	КонецЕсли;
	
	мСчетчикДокументСформирован = мСчетчикДокументСформирован + 1;
		
КонецПроцедуры // ПолеHTMLДокументСформирован()

// Процедура обновлет содержимое поля HTML
//
&НаКлиенте
Процедура ОбновитьПолеHTML()

	ВыполнитьСкрипт("location.reload(true);");

КонецПроцедуры

// Процедура - обработчик команды "УвеличитьКарту".
//
&НаКлиенте
Процедура УвеличитьКарту(Команда)
	
	ВыполнитьСкрипт("m_map.zoomIn();");	
	
КонецПроцедуры // УвеличитьКарту()

// Процедура - обработчик команды "УменьшитьКарту".
//
&НаКлиенте
Процедура УменьшитьКарту(Команда)
	
	ВыполнитьСкрипт("m_map.zoomOut();");		
	
КонецПроцедуры // УменьшитьКарту()

// Процедура - обработчик команды "КомандаОК".
//
&НаКлиенте
Процедура КомандаОК(Команда)
	
	Попытка
		
		ТекстСкрипта = "document.form.result.value = m_map.getZoom();";		
		ВыполнитьСкрипт(ТекстСкрипта);	
		Масштаб = Элементы.ПолеHTML.Документ.form.result.value;
		
		ТекстСкрипта = 
		    "var pt = m_map.getCenter();
			|pt.transform(m_map.getProjectionObject(), m_map.displayProjection);
			|document.form.result.value = pt.toShortString();
			|pt = null;";
		ВыполнитьСкрипт(ТекстСкрипта);
		СтрокаКоординат = Элементы.ПолеHTML.Документ.form.result.value;		
		СтрокаКоординат = СтрЗаменить(СтрокаКоординат,",",Символы.ПС);
		
		Долгота = Число(СокрЛП(СтрПолучитьСтроку(СтрокаКоординат,1)));
		Широта  = Число(СокрЛП(СтрПолучитьСтроку(СтрокаКоординат,2)));
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;	
	
	Закрыть(Истина);		
	
КонецПроцедуры // КомандаОК()

//Процедура выполняет скрипт на поле HTML, с учетом вида браузера.
//
&НаКлиенте
Процедура ВыполнитьСкрипт(ТекстСкрипта)
	
	ItobОперативныйМониторингКлиент.ВыполнитьСкриптНаПолеHTML(Элементы.ПолеHTML, ТекстСкрипта);		

КонецПроцедуры // ВыполнитьСкрипт()
